<?php

namespace Admin\Model;

use Common\Common\Util;
use Common\Constant\AdminTbl;
use Think\Model;
use Common\Common\Pinyin;

class FClassificationModel extends Model
{
    protected $trueTableName = AdminTbl::TBL_DN_FOSSIL_CLASSIFICATION;

    protected $data = '[{"id":5,"pId":1,"name":"化石(67174)"},{"id":17,"pId":5,"name":"古无脊椎动物(37662)"},{"id":84,"pId":17,"name":"原生动物(5102)"},{"id":366,"pId":84,"name":"丁丁虫类(0)"},{"id":367,"pId":84,"name":"放射虫类(206)"},{"id":368,"pId":84,"name":"蜓类有孔虫(2801)"},{"id":369,"pId":84,"name":"非蜓类有孔虫(2093)"},{"id":85,"pId":17,"name":"海绵动物(437)"},{"id":370,"pId":85,"name":"普通海绵纲(52)"},{"id":371,"pId":85,"name":"钙质海绵纲(63)"},{"id":372,"pId":85,"name":"硬海绵纲(0)"},{"id":373,"pId":85,"name":"层孔海绵纲(290)"},{"id":374,"pId":85,"name":"六射海绵纲(2)"},{"id":86,"pId":17,"name":"古杯动物(60)"},{"id":375,"pId":86,"name":"规则古杯纲(27)"},{"id":376,"pId":86,"name":"不规则古杯纲(29)"},{"id":87,"pId":17,"name":"腔肠动物(5063)"},{"id":377,"pId":87,"name":"水螅纲(137)"},{"id":378,"pId":87,"name":"锥石类(4)"},{"id":379,"pId":87,"name":"珊瑚纲(4916)"},{"id":88,"pId":17,"name":"蠕虫动物(40)"},{"id":380,"pId":88,"name":"环节动物类(12)"},{"id":89,"pId":17,"name":"苔藓动物(685)"},{"id":381,"pId":89,"name":"护唇纲(3)"},{"id":382,"pId":89,"name":"窄唇纲(555)"},{"id":383,"pId":89,"name":"裸唇纲(2)"},{"id":90,"pId":17,"name":"腕足动物(4471)"},{"id":384,"pId":90,"name":"无铰纲(123)"},{"id":385,"pId":90,"name":"有铰纲(4228)"},{"id":91,"pId":17,"name":"软体动物(12402)"},{"id":386,"pId":91,"name":"腹足纲(1505)"},{"id":387,"pId":91,"name":"双壳纲(6313)"},{"id":388,"pId":91,"name":"掘足纲(10)"},{"id":389,"pId":91,"name":"喙壳纲(0)"},{"id":390,"pId":91,"name":"多板纲(0)"},{"id":391,"pId":91,"name":"单板纲(69)"},{"id":392,"pId":91,"name":"竹节石纲(348)"},{"id":393,"pId":91,"name":"软舌螺纲(51)"},{"id":394,"pId":91,"name":"菊石类(2960)"},{"id":395,"pId":91,"name":"鹦鹉螺类(1061)"},{"id":92,"pId":17,"name":"节肢动物(6777)"},{"id":396,"pId":92,"name":"三叶虫纲(3777)"},{"id":397,"pId":92,"name":"昆虫纲(206)"},{"id":398,"pId":92,"name":"介形虫类(2318)"},{"id":399,"pId":92,"name":"叶肢介类(328)"},{"id":400,"pId":92,"name":"甲壳纲(41)"},{"id":93,"pId":17,"name":"棘皮动物(472)"},{"id":401,"pId":93,"name":"始海百合纲(1)"},{"id":402,"pId":93,"name":"海百合纲(229)"},{"id":403,"pId":93,"name":"海林檎纲(54)"},{"id":404,"pId":93,"name":"海胆纲(84)"},{"id":405,"pId":93,"name":"海蕾纲(4)"},{"id":406,"pId":93,"name":"海星纲(0)"},{"id":407,"pId":93,"name":"蛇尾纲(6)"},{"id":94,"pId":17,"name":"笔石动物(2099)"},{"id":408,"pId":94,"name":"笔石纲(2097)"},{"id":18,"pId":5,"name":"古脊椎动物(13210)"},{"id":95,"pId":18,"name":"无颌类(92)"},{"id":409,"pId":95,"name":"盔甲鱼亚纲(77)"},{"id":410,"pId":95,"name":"花鳞鱼亚纲(14)"},{"id":411,"pId":95,"name":"七鳃鳗亚纲(0)"},{"id":412,"pId":95,"name":"盲鳗亚纲(0)"},{"id":413,"pId":95,"name":"原始无颌类(1)"},{"id":96,"pId":18,"name":"盾皮鱼纲(263)"},{"id":414,"pId":96,"name":"胴甲鱼类(167)"},{"id":415,"pId":96,"name":"节甲鱼类(31)"},{"id":416,"pId":96,"name":"瓣甲鱼类(64)"},{"id":417,"pId":96,"name":"棘胸鱼类(0)"},{"id":418,"pId":96,"name":"褶齿鱼类(0)"},{"id":419,"pId":96,"name":"萌鳐鱼类(0)"},{"id":97,"pId":18,"name":"棘鱼纲(111)"},{"id":420,"pId":97,"name":"栅鱼类(52)"},{"id":421,"pId":97,"name":"双棘鱼类(0)"},{"id":422,"pId":97,"name":"锉棘鱼类(30)"},{"id":423,"pId":97,"name":"棘鱼类(29)"},{"id":98,"pId":18,"name":"软骨鱼纲(57)"},{"id":424,"pId":98,"name":"原始软骨鱼类(40)"},{"id":425,"pId":98,"name":"板鳃类(13)"},{"id":426,"pId":98,"name":"全头类(1)"},{"id":99,"pId":18,"name":"硬骨鱼纲(2097)"},{"id":427,"pId":99,"name":"原始肉鳍鱼类(1)"},{"id":428,"pId":99,"name":"爪齿鱼类(6)"},{"id":429,"pId":99,"name":"空棘鱼类(4)"},{"id":430,"pId":99,"name":"原始肺鱼形动物(0)"},{"id":431,"pId":99,"name":"孔鳞鱼类(0)"},{"id":432,"pId":99,"name":"肺鱼类(10)"},{"id":433,"pId":99,"name":"原始四足形动物(210)"},{"id":434,"pId":99,"name":"根齿鱼类(0)"},{"id":435,"pId":99,"name":"骨鳞鱼类(5)"},{"id":436,"pId":99,"name":"希望螈类(0)"},{"id":437,"pId":99,"name":"多鳍鱼类(8)"},{"id":438,"pId":99,"name":"原始辐鳍鱼类(265)"},{"id":439,"pId":99,"name":"软骨硬鳞鱼类(41)"},{"id":440,"pId":99,"name":"原始新鳍鱼类(1)"},{"id":441,"pId":99,"name":"雀鳝部(5)"},{"id":442,"pId":99,"name":"原始鲱口类(10)"},{"id":443,"pId":99,"name":"鲱亚部(37)"},{"id":444,"pId":99,"name":"真骨鱼亚部(1181)"},{"id":100,"pId":18,"name":"两栖纲(299)"},{"id":445,"pId":100,"name":"原始四足类(1)"},{"id":446,"pId":100,"name":"离片椎类(7)"},{"id":447,"pId":100,"name":"石炭蜥类(0)"},{"id":448,"pId":100,"name":"壳椎两栖类(2)"},{"id":449,"pId":100,"name":"无尾类(4)"},{"id":450,"pId":100,"name":"有尾类(270)"},{"id":451,"pId":100,"name":"其他滑体两栖类(1)"},{"id":452,"pId":100,"name":"其他迷齿两栖类(13)"},{"id":101,"pId":18,"name":"爬行纲(1860)"},{"id":453,"pId":101,"name":"龟鳖类(149)"},{"id":454,"pId":101,"name":"大鼻龙类(2)"},{"id":455,"pId":101,"name":"前棱蜥类(22)"},{"id":456,"pId":101,"name":"锯齿龙类(1)"},{"id":457,"pId":101,"name":"中龙类(0)"},{"id":458,"pId":101,"name":"离龙类(34)"},{"id":459,"pId":101,"name":"蜥蜴类(22)"},{"id":460,"pId":101,"name":"蛇类(1)"},{"id":461,"pId":101,"name":"其他鳞龙类(3)"},{"id":462,"pId":101,"name":"原龙类(2)"},{"id":463,"pId":101,"name":"鳍龙类(58)"},{"id":464,"pId":101,"name":"海龙类(19)"},{"id":465,"pId":101,"name":"鱼龙类(11)"},{"id":466,"pId":101,"name":"鳄类(74)"},{"id":467,"pId":101,"name":"其他鳄型类(24)"},{"id":468,"pId":101,"name":"翼龙类(20)"},{"id":469,"pId":101,"name":"蜥臀类恐龙(979)"},{"id":470,"pId":101,"name":"鸟臀类恐龙(321)"},{"id":471,"pId":101,"name":"其他初龙型类(2)"},{"id":472,"pId":101,"name":"盘龙类(0)"},{"id":473,"pId":101,"name":"恐头兽类(5)"},{"id":474,"pId":101,"name":"始巨鳄类(1)"},{"id":475,"pId":101,"name":"兽头类(3)"},{"id":476,"pId":101,"name":"二齿兽类(21)"},{"id":477,"pId":101,"name":"犬齿兽类(22)"},{"id":478,"pId":101,"name":"其他兽孔类(25)"},{"id":102,"pId":18,"name":"鸟纲(204)"},{"id":479,"pId":102,"name":"原始基干鸟类(3)"},{"id":480,"pId":102,"name":"反鸟类(2)"},{"id":481,"pId":102,"name":"今鸟类(193)"},{"id":103,"pId":18,"name":"古哺乳动物(8223)"},{"id":482,"pId":103,"name":"哺乳动物型(7)"},{"id":483,"pId":103,"name":"原始哺乳动物(5)"},{"id":484,"pId":103,"name":"多瘤齿兽目(4)"},{"id":485,"pId":103,"name":"贫齿目(1)"},{"id":486,"pId":103,"name":"有袋目(0)"},{"id":487,"pId":103,"name":"原真兽目(10)"},{"id":488,"pId":103,"name":"食虫目(421)"},{"id":489,"pId":103,"name":"翼手目(42)"},{"id":490,"pId":103,"name":"攀鼩目(1)"},{"id":491,"pId":103,"name":"灵长目(42)"},{"id":492,"pId":103,"name":"亚兽目(89)"},{"id":493,"pId":103,"name":"混齿目(136)"},{"id":494,"pId":103,"name":"模鼠兔目(2)"},{"id":495,"pId":103,"name":"兔形目(506)"},{"id":496,"pId":103,"name":"啮齿目(3439)"},{"id":497,"pId":103,"name":"肉齿目(29)"},{"id":498,"pId":103,"name":"食肉目(420)"},{"id":499,"pId":103,"name":"全齿目(181)"},{"id":500,"pId":103,"name":"裂齿目(18)"},{"id":501,"pId":103,"name":"纽齿目(0)"},{"id":502,"pId":103,"name":"南方有蹄目(31)"},{"id":503,"pId":103,"name":"恐角目(22)"},{"id":504,"pId":103,"name":"踝节目(62)"},{"id":505,"pId":103,"name":"中兽目(25)"},{"id":506,"pId":103,"name":"蹄兔目(2)"},{"id":507,"pId":103,"name":"鲸目(0)"},{"id":508,"pId":103,"name":"海牛目(0)"},{"id":509,"pId":103,"name":"长鼻目(344)"},{"id":510,"pId":103,"name":"奇蹄目(1242)"},{"id":511,"pId":103,"name":"偶蹄目(1067)"},{"id":512,"pId":103,"name":"其他有胎盘类(41)"},{"id":19,"pId":5,"name":"古植物(5250)"},{"id":104,"pId":19,"name":"菌藻类(953)"},{"id":513,"pId":104,"name":"蓝藻及细菌（包括叠层石）(123)"},{"id":514,"pId":104,"name":"硅藻(1)"},{"id":515,"pId":104,"name":"绿藻(17)"},{"id":516,"pId":104,"name":"红藻及其它宏观藻(15)"},{"id":517,"pId":104,"name":"轮藻(781)"},{"id":518,"pId":104,"name":"甲藻(0)"},{"id":519,"pId":104,"name":"颗石藻(0)"},{"id":520,"pId":104,"name":"疑源类及其它(14)"},{"id":105,"pId":19,"name":"真菌类(0)"},{"id":521,"pId":105,"name":"真菌类(0)"},{"id":106,"pId":19,"name":"苔藓及地衣(47)"},{"id":522,"pId":106,"name":"苔类(38)"},{"id":523,"pId":106,"name":"藓类(7)"},{"id":524,"pId":106,"name":"地衣(0)"},{"id":107,"pId":19,"name":"分类不明的早期陆地植物(8)"},{"id":525,"pId":107,"name":"分类不明的早期陆地植物(7)"},{"id":108,"pId":19,"name":"蕨类植物（广义）(1637)"},{"id":526,"pId":108,"name":"瑞尼蕨植物(3)"},{"id":527,"pId":108,"name":"工蕨植物(1)"},{"id":528,"pId":108,"name":"三枝蕨植物(1)"},{"id":529,"pId":108,"name":"石松植物(172)"},{"id":530,"pId":108,"name":"有节植物(406)"},{"id":531,"pId":108,"name":"真蕨植物(779)"},{"id":109,"pId":19,"name":"分类不明的蕨形叶(147)"},{"id":532,"pId":109,"name":"分类不明的蕨形叶(147)"},{"id":110,"pId":19,"name":"前裸子植物(32)"},{"id":533,"pId":110,"name":"前裸子植物(27)"},{"id":111,"pId":19,"name":"早期裸子植物(348)"},{"id":534,"pId":111,"name":"种子蕨植物(273)"},{"id":535,"pId":111,"name":"其它裸子植物(71)"},{"id":112,"pId":19,"name":"裸子植物(1388)"},{"id":536,"pId":112,"name":"苏铁类植物(510)"},{"id":537,"pId":112,"name":"银杏类植物(335)"},{"id":538,"pId":112,"name":"松柏类植物(311)"},{"id":539,"pId":112,"name":"买麻藤类植物(192)"},{"id":113,"pId":19,"name":"被子植物(254)"},{"id":540,"pId":113,"name":"被子植物(230)"},{"id":114,"pId":19,"name":"其它分类不明的植物(70)"},{"id":541,"pId":114,"name":"生殖器官(29)"},{"id":542,"pId":114,"name":"营养器官(5)"},{"id":115,"pId":19,"name":"孢粉(283)"},{"id":543,"pId":115,"name":"孢子(193)"},{"id":544,"pId":115,"name":"花粉(90)"},{"id":20,"pId":5,"name":"遗迹化石(334)"},{"id":116,"pId":20,"name":"遗物(33)"},{"id":545,"pId":116,"name":"恐龙蛋及其它(31)"},{"id":117,"pId":20,"name":"遗迹(295)"},{"id":546,"pId":117,"name":"爬行迹(92)"},{"id":547,"pId":117,"name":"居住迹(49)"},{"id":548,"pId":117,"name":"休息迹(18)"},{"id":549,"pId":117,"name":"觅食迹(51)"},{"id":550,"pId":117,"name":"进食迹(30)"},{"id":551,"pId":117,"name":"逃逸迹(0)"},{"id":552,"pId":117,"name":"耕作迹(10)"},{"id":553,"pId":117,"name":"捕食迹(7)"},{"id":554,"pId":117,"name":"均衡迹(0)"},{"id":21,"pId":5,"name":"古人类及类人猿(1998)"},{"id":118,"pId":21,"name":"古人类(1626)"},{"id":555,"pId":118,"name":"南方古猿(134)"},{"id":556,"pId":118,"name":"能人(5)"},{"id":557,"pId":118,"name":"直立人(222)"},{"id":558,"pId":118,"name":"早期智人(271)"},{"id":559,"pId":118,"name":"晚期智人(986)"},{"id":119,"pId":21,"name":"类人猿(343)"},{"id":560,"pId":119,"name":"古猿(343)"},{"id":120,"pId":21,"name":"分类不明的早期人类(27)"},{"id":561,"pId":120,"name":"分类不明的早期人类(27)"},{"id":22,"pId":5,"name":"古人类遗物(7988)"},{"id":121,"pId":22,"name":"石制品(7959)"},{"id":562,"pId":121,"name":"石锤(14)"},{"id":563,"pId":121,"name":"石砧(6)"},{"id":564,"pId":121,"name":"石核(2374)"},{"id":565,"pId":121,"name":"石片(2477)"},{"id":566,"pId":121,"name":"石器(1516)"},{"id":567,"pId":121,"name":"断块(1522)"},{"id":568,"pId":121,"name":"残片(22)"},{"id":569,"pId":121,"name":"碎屑(27)"},{"id":122,"pId":22,"name":"骨（木）制品(0)"},{"id":570,"pId":122,"name":"骨器(0)"},{"id":571,"pId":122,"name":"角器(0)"},{"id":572,"pId":122,"name":"木器(0)"},{"id":573,"pId":122,"name":"其他(0)"},{"id":123,"pId":22,"name":"装饰品(0)"},{"id":574,"pId":123,"name":"有孔类(0)"},{"id":575,"pId":123,"name":"有刻痕类(0)"},{"id":576,"pId":123,"name":"其他(0)"},{"id":124,"pId":22,"name":"其他遗迹或遗物(29)"},{"id":577,"pId":124,"name":"其他遗迹或遗物(29)"},{"id":23,"pId":5,"name":"分类位置不明(732)"},{"id":125,"pId":23,"name":"牙形刺(658)"},{"id":578,"pId":125,"name":"牙形刺(657)"},{"id":126,"pId":23,"name":"几丁虫(16)"},{"id":579,"pId":126,"name":"几丁虫(16)"},{"id":127,"pId":23,"name":"小壳(48)"}]';

    public function info($id = 0)
    {
        $w = ['id' => $id];
        $this->where($w);
        $ret = $this->find();
        return $ret;
    }

    public function initData()
    {
        $data = json_decode($this->data, true);
        foreach ($data as $k => &$item) {
            $item['name_zh'] = preg_replace(array('/\d+/', '/\(/', '/\)/'), '', $item['name']);
            $item['pinyin'] = strtoupper(Pinyin::encode($item['name_zh']));
        }
        M()->startTrans();
        try {
            foreach ($data as $v) {
                $o = M()->table(AdminTbl::TBL_DN_FOSSIL_CLASSIFICATION);
                $par = [
                    'id' => $v['id'],
                    'pid' => $v['pId'],
                    'name_zh' => $v['name_zh'],
                    'pinyin' => $v['pinyin'],
                    'ctime' => time(),
                    'utime' => time(),
                    'code' => $v['pinyin'],
                ];
                $r = $o->add($par);
                if ($r === false) {
                    throw new \Exception('fail');
                }
            }
        } catch (\Exception $e) {
            M()->rollback();
            echo $e->getMessage();
        }
        M()->commit();
        echo 'ok';
    }

    public function formatData()
    {
        $o = M()->table(AdminTbl::TBL_DN_FOSSIL_CLASSIFICATION);
        $field = [
            'id as value',
            'pid as pvalue',
            'name_zh as label',
        ];
        $o = $o->field($field);
        $data = $o->select();
        $data = Util::toTree($data, 1, 'value', 'pvalue');
        $ret = $data[0]['children'];
        return $ret;
    }
}